Netzpfuscher/VESC_GD32/Src/main.c
  RCU_CFG1 |= ((1<<30) | (1<<0)); // PLLPRESEL 1 (48Mhz RC); PREDV0 (/2) = 24 Mhz
  RCU_CFG0 |= (1<<17);

  RCU_ADDCTL |= ((1<<16) | (1<<0));
  while((RCU_ADDCTL & (1<<17))){

  }

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL5;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV4;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV4;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
  /** Enables the Clock Security System
  */
  HAL_RCC_EnableCSS();
}

/**
  * @brief NVIC Configuration.
  * @retval None
  */
static void MX_NVIC_Init(void)
{
  /* ADC1_2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(ADC1_2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(ADC1_2_IRQn);
  /* TIM1_UP_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(TIM1_UP_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(TIM1_UP_IRQn);
  /* TIM1_BRK_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(TIM1_BRK_IRQn, 6, 0);
  HAL_NVIC_EnableIRQ(TIM1_BRK_IRQn);
  /* DMA1_Channel1_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 6, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
  /* TIM3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(TIM3_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(TIM3_IRQn);
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_InjectionConfTypeDef sConfigInjected = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */
  /** Common config
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  sConfigInjected.InjectedRank = 0;

 //Counting number of conversions
  sConfigInjected.InjectedNbrOfConversion = 0;
#if ADC1_INJ_1_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif
#if ADC1_INJ_2_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif
#if ADC1_INJ_3_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif
#if ADC1_INJ_4_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif

  sConfigInjected.ExternalTrigInjecConv = ADC_EXTERNALTRIGINJECCONV_T1_TRGO;
  sConfigInjected.AutoInjectedConv = DISABLE;
  sConfigInjected.InjectedDiscontinuousConvMode = DISABLE;
  sConfigInjected.InjectedOffset = 0;

#if ADC1_INJ_1_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC1_INJ_1_CH;
  sConfigInjected.InjectedSamplingTime = ADC1_INJ_1_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
  /** Configure Injected Channel
  */
#if ADC1_INJ_2_ENABLED
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC1_INJ_2_CH;
  sConfigInjected.InjectedSamplingTime = ADC1_INJ_2_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
#if ADC1_INJ_3_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC1_INJ_3_CH;
  sConfigInjected.InjectedSamplingTime = ADC1_INJ_3_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
#if ADC1_INJ_4_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC1_INJ_4_CH;
  sConfigInjected.InjectedSamplingTime = ADC1_INJ_4_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc1, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

}

/**
  * @brief ADC2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC2_Init(void)
{

  /* USER CODE BEGIN ADC2_Init 0 */

  /* USER CODE END ADC2_Init 0 */

  ADC_InjectionConfTypeDef sConfigInjected = {0};

  /* USER CODE BEGIN ADC2_Init 1 */

  /* USER CODE END ADC2_Init 1 */
  /** Common config
  */
  hadc2.Instance = ADC2;
  hadc2.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc2.Init.ContinuousConvMode = DISABLE;
  hadc2.Init.DiscontinuousConvMode = DISABLE;
  hadc2.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc2.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc2.Init.NbrOfConversion = 1;
  if (HAL_ADC_Init(&hadc2) != HAL_OK)
  {
    Error_Handler();
  }


  sConfigInjected.InjectedRank = 0;

 //Counting number of conversions
  sConfigInjected.InjectedNbrOfConversion = 0;
#if ADC2_INJ_1_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif
#if ADC2_INJ_2_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif
#if ADC2_INJ_3_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif
#if ADC2_INJ_4_ENABLED
  sConfigInjected.InjectedNbrOfConversion++;
#endif

  sConfigInjected.ExternalTrigInjecConv = ADC_EXTERNALTRIGINJECCONV_T1_TRGO;
  sConfigInjected.AutoInjectedConv = DISABLE;
  sConfigInjected.InjectedDiscontinuousConvMode = DISABLE;
  sConfigInjected.InjectedOffset = 0;

#if ADC2_INJ_1_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC2_INJ_1_CH;
  sConfigInjected.InjectedSamplingTime = ADC2_INJ_1_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc2, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
#if ADC2_INJ_2_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC2_INJ_2_CH;
  sConfigInjected.InjectedSamplingTime = ADC2_INJ_2_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc2, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
#if ADC2_INJ_3_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC2_INJ_3_CH;
  sConfigInjected.InjectedSamplingTime = ADC2_INJ_3_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc2, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif
#if ADC2_INJ_4_ENABLED
  /** Configure Injected Channel
  */
  sConfigInjected.InjectedRank++;
  sConfigInjected.InjectedChannel = ADC2_INJ_4_CH;
  sConfigInjected.InjectedSamplingTime = ADC2_INJ_4_TIM;
  if (HAL_ADCEx_InjectedConfigChannel(&hadc2, &sConfigInjected) != HAL_OK)
  {
    Error_Handler();
  }
#endif

